0010* MAP2: PROTOTYPE             --- CREATED BY UNIX 6.3.4 ---
0020* WRITE USING MAP 'XXXXXXXX'
0030*     D142-13-CADS-SIMU.CODG-CATG-DOCM-SIMU
0040*     D142-13-CADS-SIMU.CODG-TIPO-DOCM-COBR
0050*     D142-13-CADS-SIMU.CODG-TIPO-DOCM-SIMU
0060*     D142-13-CADS-SIMU.DATA-DOCM-COBR D142-13-CADS-SIMU.INDC-SITC-SIMU
0070*     D142-13-CADS-SIMU.INDC-VISA-IC1
0080*     D142-13-CADS-SIMU.NUMR-CNPJ-FORN-MATL
0090*     D142-13-CADS-SIMU.NUMR-CONT-MATL D142-13-CADS-SIMU.NUMR-DOCM-COBR
0100*     D142-13-CADS-SIMU.NUMR-DOCM-SIMU D142-13-CADS-SIMU.NUMR-PARC-MATL
0110*     D142-13-CADS-SIMU.VALR-DOCM-COBR D142-13-CADS-SIMU.VALR-DOCM-SIMU
0120*     EFETIVA FUNCAO L001-CODG-CATG-DOCM-SIMU L001-CODG-TIPO-DOCM-COBR
0130*     L001-CODG-TIPO-DOCM-SIMU L001-DATA-DOCM-COBR L001-INDC-SITC-SIMU
0140*     L001-INDC-VISA-IC1 L001-NUMR-CNPJ-FORN-MATL L001-NUMR-CONT-MATL
0150*     L001-NUMR-DOCM-COBR L001-NUMR-PARC-MATL L001-VALR-DOCM-COBR
0160*     L001-VALR-DOCM-SIMU NUMERO-ISN NUMERO-SMP WTL-IDNF-FILE
0170*     WTL-STTS-REGS WTL-USER-RESP
0180DEFINE DATA PARAMETER
01901 D142-13-CADS-SIMU.CODG-CATG-DOCM-SIMU (A001)
02001 D142-13-CADS-SIMU.CODG-TIPO-DOCM-COBR (N02,0)
02101 D142-13-CADS-SIMU.CODG-TIPO-DOCM-SIMU (N02,0)
02201 D142-13-CADS-SIMU.DATA-DOCM-COBR (N08,0)
02301 D142-13-CADS-SIMU.INDC-SITC-SIMU (A002)
02401 D142-13-CADS-SIMU.INDC-VISA-IC1 (N02,0)
02501 D142-13-CADS-SIMU.NUMR-CNPJ-FORN-MATL (N14,0)
02601 D142-13-CADS-SIMU.NUMR-CONT-MATL (N10,0)
02701 D142-13-CADS-SIMU.NUMR-DOCM-COBR (N09,0)
02801 D142-13-CADS-SIMU.NUMR-DOCM-SIMU (N09,0)
02901 D142-13-CADS-SIMU.NUMR-PARC-MATL (N03,0)
03001 D142-13-CADS-SIMU.VALR-DOCM-COBR (N15,2)
03101 D142-13-CADS-SIMU.VALR-DOCM-SIMU (N15,2)
03201 EFETIVA (A020)
03301 FUNCAO (A020)
03401 L001-CODG-CATG-DOCM-SIMU (A020)
03501 L001-CODG-TIPO-DOCM-COBR (A020)
03601 L001-CODG-TIPO-DOCM-SIMU (A020)
03701 L001-DATA-DOCM-COBR (A020)
03801 L001-INDC-SITC-SIMU (A020)
03901 L001-INDC-VISA-IC1 (A020)
04001 L001-NUMR-CNPJ-FORN-MATL (A020)
04101 L001-NUMR-CONT-MATL (A020)
04201 L001-NUMR-DOCM-COBR (A020)
04301 L001-NUMR-PARC-MATL (A020)
04401 L001-VALR-DOCM-COBR (A020)
04501 L001-VALR-DOCM-SIMU (A020)
04601 NUMERO-ISN (N10,0)
04701 NUMERO-SMP (A020)
04801 WTL-IDNF-FILE (A020)
04901 WTL-STTS-REGS (A005)
05001 WTL-USER-RESP (A010)
0510END-DEFINE
0520FORMAT PS=024 LS=081 ZP=OFF SG=OFF KD=OFF IP=OFF
0530* MAP2: MAP PROFILES *****************************        200***********
0540* ,TTAAAMMOO   D I D I N D I D I        ?_)^&:+(                       *
0550* 024080        N0NNUCN____        X         01 SYSDBA  NR             *
0560************************************************************************
0570WRITE ( AD=D                                                          /*
0580                                                                       )
0590 001T 'AJUSTES NA BASE DE DADOS DO ARQUIVO'
0600 037T WTL-IDNF-FILE  (AD=ILO ) /*.01U020 A020 .
0610/
0620/
0630 001T '------------------------------.-----------------------.---'-
0640      '---------------------'
0650/
0660 002T 'Autorização:'
0670 015T NUMERO-SMP  (AD=OILT'_' AL=015  ) /*.01D015 A020 .
0680 031T '|'
0690 033T 'Executor:'
0700 043T WTL-USER-RESP  (AD=ILO ) /*.01U010 A010 .
0710 055T '|'
0720 057T 'Status.........:'
0730 074T WTL-STTS-REGS  (AD=ILO ) /*.01U005 A005 .
0740/
0750 002T 'Função.....:'
0760 015T FUNCAO  (AD=OILT'_' AL=010  ) /*.01D010 A020 .
0770 031T '|'
0780 033T 'Data....:'
0790 043T *DAT4E  (AD=ILO ) /*.01S010 A010 .
0800 055T '|'
0810 057T 'Efetiva Ajustes?'
0820 075T EFETIVA  (AD=OILT'_' AL=003  ) /*.01D003 A020 .
0830/
0840 002T 'Numero ISN.:'
0850 015T NUMERO-ISN  (AD=OIR EM=9999999999 ) /*.01D010 N10,0.
0860 031T '|'
0870 033T 'Hora....:'
0880 043T *TIME  (AD=ILO ) /*.01S010 A010 .
0890 055T '|'
0900 057T 'Simulacao..:'
0910 070T D142-13-CADS-SIMU.NUMR-DOCM-SIMU  (AD=OIR /*.01D009 N09,0.
0920      EM=999999999 )
0930/
0940 001T '------------------------------''-----------------------+---'-
0950      '---------------------'
0960/
0970 002T 'Campos do Arquivo'
0980 024T '|'
0990 026T 'Valor do Campo no Arquivo'
1000 055T '|'
1010 057T 'Parametros Informados'
1020/
1030 001T '-----------------------+------------------------------+---'-
1040      '---------------------'
1050/
1060 002T 'CODG-TIPO-DOCM-SIMU..'
1070 024T '|'
1080 026T D142-13-CADS-SIMU.CODG-TIPO-DOCM-SIMU  (AD=OIR /*.01D002 N02,0.
1090      EM=99 ZP=ON )
1100 055T '|'
1110 057T L001-CODG-TIPO-DOCM-SIMU  (AD=OILT'_' ) /*.01D020 A020 .
1120/
1130 002T 'CODG-CATG-DOCM-SIMU..'
1140 024T '|'
1150 026T D142-13-CADS-SIMU.CODG-CATG-DOCM-SIMU  /*.01D001 A001 .
1160      (AD=OILT'_' )
1170 055T '|'
1180 057T L001-CODG-CATG-DOCM-SIMU  (AD=OILT'_' ) /*.01D020 A020 .
1190/
1200 002T 'NUMR-CONT-MATL.......'
1210 024T '|'
1220 026T D142-13-CADS-SIMU.NUMR-CONT-MATL  (AD=OIR /*.01D010 N10,0.
1230      EM=9999999999 ZP=ON )
1240 055T '|'
1250 057T L001-NUMR-CONT-MATL  (AD=OILT'_' ) /*.01D020 A020 .
1260/
1270 002T 'NUMR-CNPJ-FORN-MATL..'
1280 024T '|'
1290 026T D142-13-CADS-SIMU.NUMR-CNPJ-FORN-MATL  (AD=OIR /*.01D014 N14,0.
1300      EM=99999999999999 ZP=ON )
1310 055T '|'
1320 057T L001-NUMR-CNPJ-FORN-MATL  (AD=OILT'_' ) /*.01D020 A020 .
1330/
1340 002T 'NUMR-PARC-MATL.......'
1350 024T '|'
1360 026T D142-13-CADS-SIMU.NUMR-PARC-MATL  (AD=OIR EM=999 /*.01D003 N03,0.
1370      ZP=ON )
1380 055T '|'
1390 057T L001-NUMR-PARC-MATL  (AD=OILT'_' ) /*.01D020 A020 .
1400/
1410 002T 'VALR-DOCM-SIMU.......'
1420 024T '|'
1430 026T D142-13-CADS-SIMU.VALR-DOCM-SIMU  (AD=OIR /*.01D018 N15,2.
1440      EM=999999999999999,99 ZP=ON )
1450 055T '|'
1460 057T L001-VALR-DOCM-SIMU  (AD=OILT'_' ) /*.01D020 A020 .
1470/
1480 002T 'INDC-SITC-SIMU.......'
1490 024T '|'
1500 026T D142-13-CADS-SIMU.INDC-SITC-SIMU  (AD=OILT'_' ) /*.01D002 A002 .
1510 055T '|'
1520 057T L001-INDC-SITC-SIMU  (AD=OILT'_' ) /*.01D020 A020 .
1530/
1540 002T 'CODG-TIPO-DOCM-COBR..'
1550 024T '|'
1560 026T D142-13-CADS-SIMU.CODG-TIPO-DOCM-COBR  (AD=OIR /*.01D002 N02,0.
1570      EM=99 ZP=ON )
1580 055T '|'
1590 057T L001-CODG-TIPO-DOCM-COBR  (AD=OILT'_' ) /*.01D020 A020 .
1600/
1610 002T 'NUMR-DOCM-COBR.......'
1620 024T '|'
1630 026T D142-13-CADS-SIMU.NUMR-DOCM-COBR  (AD=OIR /*.01D009 N09,0.
1640      EM=999999999 )
1650 055T '|'
1660 057T L001-NUMR-DOCM-COBR  (AD=OILT'_' ) /*.01D020 A020 .
1670/
1680 002T 'DATA-DOCM-COBR.......'
1690 024T '|'
1700 026T D142-13-CADS-SIMU.DATA-DOCM-COBR  (AD=OIR /*.01D008 N08,0.
1710      EM=99999999 ZP=ON )
1720 055T '|'
1730 057T L001-DATA-DOCM-COBR  (AD=OILT'_' ) /*.01D020 A020 .
1740/
1750 002T 'VALR-DOCM-COBR.......'
1760 024T '|'
1770 026T D142-13-CADS-SIMU.VALR-DOCM-COBR  (AD=OIR /*.01D018 N15,2.
1780      EM=999999999999999,99 ZP=ON )
1790 055T '|'
1800 057T L001-VALR-DOCM-COBR  (AD=OILT'_' ) /*.01D020 A020 .
1810/
1820 002T 'INDC-VISA-IC1........'
1830 024T '|'
1840 026T D142-13-CADS-SIMU.INDC-VISA-IC1  (AD=OIR EM=99 /*.01D002 N02,0.
1850      ZP=ON )
1860 055T '|'
1870 057T L001-INDC-VISA-IC1  (AD=OILT'_' ) /*.01D020 A020 .
1880/
1890 001T '-' (079)
1900* MAP2: VALIDATION *****************************************************
1910RULEVAR D01D142-13-CADS-SIMU.NUMR-DOCM-SIMU
1920* CDIR D9013142-13                     NUMR-DOCM-SIMU                  ;
1930RULEVAR D01D142-13-CADS-SIMU.CODG-TIPO-DOCM-SIMU
1940* CDIR D9013142-13                     CODG-TIPO-DOCM-SIMU             ;
1950RULEVAR D01D142-13-CADS-SIMU.CODG-CATG-DOCM-SIMU
1960* CDIR D9013142-13                     CODG-CATG-DOCM-SIMU             ;
1970RULEVAR D01D142-13-CADS-SIMU.NUMR-CONT-MATL
1980* CDIR D9013142-13                     NUMR-CONT-MATL                  ;
1990RULEVAR D01D142-13-CADS-SIMU.NUMR-CNPJ-FORN-MATL
2000* CDIR D9013142-13                     NUMR-CNPJ-FORN-MATL             ;
2010RULEVAR D01D142-13-CADS-SIMU.NUMR-PARC-MATL
2020* CDIR D9013142-13                     NUMR-PARC-MATL                  ;
2030RULEVAR D01D142-13-CADS-SIMU.VALR-DOCM-SIMU
2040* CDIR D9013142-13                     VALR-DOCM-SIMU                  ;
2050RULEVAR D01D142-13-CADS-SIMU.INDC-SITC-SIMU
2060* CDIR D9013142-13                     INDC-SITC-SIMU                  ;
2070RULEVAR D01D142-13-CADS-SIMU.CODG-TIPO-DOCM-COBR
2080* CDIR D9013142-13                     CODG-TIPO-DOCM-COBR             ;
2090RULEVAR D01D142-13-CADS-SIMU.NUMR-DOCM-COBR
2100* CDIR D9013142-13                     NUMR-DOCM-COBR                  ;
2110RULEVAR D01D142-13-CADS-SIMU.DATA-DOCM-COBR
2120* CDIR D9013142-13                     DATA-DOCM-COBR                  ;
2130RULEVAR D01D142-13-CADS-SIMU.VALR-DOCM-COBR
2140* CDIR D9013142-13                     VALR-DOCM-COBR                  ;
2150RULEVAR D01D142-13-CADS-SIMU.INDC-VISA-IC1
2160* CDIR D9013142-13                     INDC-VISA-IC1                   ;
2170* MAP2: END OF MAP *****************************************************
2180END
